# Concat

In [2]:
import pandas as pd

pandas.concat(
    obj: sequence or mapping of series or DataFrame Objects
    axis: {0/index,1/columns}, default 0
    join: {'inner','outer'}, default False
    keys: sequence, default None
    levels: list of sequence, default None
    name: list, default None
    verify_integrity: bool. default False
    sort: bool, default False
    copy: bool, default True
)

Return: object, type objs
When concatenating all series aling the index (axis=0), a series is returned. When objs contains at least one dataframe, a dataframe is treturned. When concatenating along the columns (axis=1),a DataFrame is returned

# Index
- [Combine Two Series](#1-combine-series)
- [Combine Two Dataframe](#2-combine-two-dataframe)
- [Combine DataFrame objects with overlapping columns](#3-combine-dataframe-objects-with-overlapping-columns)
- [Verify Integrity](#4-verify-integrity)
- [Append a single row to the end of a dataframe](#5-append-a-single-row-to-the-end-of-a-dataframe-object)

## 1. Combine Series

In [3]:
s1 = pd.Series(['a','b'])
s2 = pd.Series(['c','d'])

pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [4]:
#ignore index
pd.concat([s1,s2],ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [5]:
#hierarchical index
pd.concat([s1,s2],keys=['s1','s2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [6]:
pd.concat([s1,s2], keys=['s1','s2'], names=['Series name','Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

## 2. Combine Two Dataframe

In [7]:
df1 = pd.DataFrame(
                    data = [    
                            ['a', 1], 
                            ['b', 2]
                        ],
                    columns=['letter', 'number']
                )
df1

  letter  number
0      a       1
1      b       2

In [8]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [10]:
pd.concat([df1,df2],ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

## 3. Combine DataFrame objects with overlapping columns

In [11]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [13]:
print(df1)
print(df3)

  letter  number
0      a       1
1      b       2
  letter  number animal
0      c       3    cat
1      d       4    dog

In [14]:
pd.concat([df1,df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [15]:
pd.concat([df1,df3],ignore_index=True)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
2      c       3    cat
3      d       4    dog

In [16]:
pd.concat([df1,df3],join='inner')

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [17]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])

In [19]:
print(df1)
print()
print(df4)

  letter  number
0      a       1
1      b       2

   animal    name
0    bird   polly
1  monkey  george

In [20]:
pd.concat([df1,df4])

  letter  number  animal    name
0      a     1.0     NaN     NaN
1      b     2.0     NaN     NaN
0    NaN     NaN    bird   polly
1    NaN     NaN  monkey  george

In [21]:
pd.concat([df1,df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

## 4. verify Integrity

In [22]:
df5 = pd.DataFrame([1], index=['a'])
df5
df6 = pd.DataFrame([2], index=['a'])
df6

print(df5)
print()
print(df6)

   0
a  1

   0
a  2

In [25]:
# pd.concat([df5,df6],verify_integrity=True)

## 5. Append a single row to the end of a DataFrame object

In [26]:
df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
df7

new_row = pd.Series({'a': 3, 'b': 4})
new_row

print(df7)
print()
print(new_row)

   a  b
0  1  2

a    3
b    4
dtype: int64

In [27]:
pd.concat([df7, new_row.to_frame().T], ignore_index=True)

   a  b
0  1  2
1  3  4